ops/salus-dependencies.dot
digraph G {
    user [shape="none"]
    racker [shape="none"]
    envoy

    // box shape == 3rd party software
 mysql [shape="box"]
    repose_auth [shape="box", label="Repose\nAuth Service"]
    repose_public_api [shape="box", label="Repose\nPublic API"]
    kapacitor [shape="box"]
    kube_api [shape="box", label="Kubernetes API"]
    vault [shape="box"]
    etcd [shape="box"]
    umb [shape="box"]
    saml_auth_proxy [shape="box"]

    // Salus modules
 public_api [label="Public API"]
    admin_api [label="Admin API"]
    pm [label="Presence Monitor"]
    auth [label="Auth Service"]
    ambassador [label="Ambassador"]
    evm [label="Event Engine Management"]
    evi [label="Event Engine Ingest"]
    rm [label="Resource Management"]
    mm [label="Monitor Management"]
    zw [label="Zone Watcher"]

    evm -> kapacitor
    evm -> mysql
    evm -> kube_api [label="calls"]

    evi -> kapacitor
    evi -> umb [label="consumes"]
    evi -> kube_api [label="calls"]

    rm -> umb
    rm -> mysql

    mm -> umb
    mm -> rm [label="calls"]
    mm -> mysql
    mm -> etcd

    pm -> umb [label="produces"]
    pm -> etcd
    pm -> rm [label="calls"]

    zw -> etcd
    zw -> umb [label="produces"]
    zw -> mm [label="calls"]

    envoy -> ambassador [label="gRPC\nTLS pass-thru"]
    ambassador -> umb
    ambassador -> etcd
    ambassador -> vault
    ambassador -> mm [label="calls"]
    ambassador -> rm [label="calls"]

    envoy -> repose_auth [label="calls"]
    repose_auth -> auth
    auth -> vault

    user -> repose_public_api
    repose_public_api -> public_api
    public_api -> etcd
    public_api -> rm [label="proxies to"]
    public_api -> mm [label="proxies to"]
    public_api -> evm [label="proxies to"]

    racker -> saml_auth_proxy
    saml_auth_proxy -> admin_api
    admin_api -> etcd
}
